In [2]:
from sqlalchemy import create_engine
import pandas as pd

**I have set up a server online for you to practice with. The credentials are:**
- RDBMS = postgresql
- server = djynnius.com
- username = admin 
- password = 3ikakkeMuSigmaPassword
- database = musigma 
- port = 5444

**The database has 3 tables:**
1. students 
2. nhanes 
3. diseases (note this is a very large table with a quarter fo a million records so when grabbing data from it you may want to limit it to just a few thousands at a time)

In [3]:
rdbms = 'postgresql'
server = 'djynnius.com'
username = 'admin' 
password = '3ikakkeMuSigmaPassword'
database = 'musigma'
port = 5444

engine = create_engine(f"{rdbms}://{username}:{password}@{server}:{port}/{database}")

**Getting data from the students table**

In [4]:
nhanes = pd.read_sql("SELECT * FROM nhanes", engine)

**Now you can proceed to carry out pandas data manipulation on the nhanes dataset**

In [8]:
#Looking at the first 10 records, and limiting the fields to Survey Year, Age, Race, Educational Level, and Sex
nhanes.loc[0:10, ['SurveyYr', 'Age', 'Race1', 'Education', 'Gender']]

   SurveyYr  Age     Race1       Education  Gender
0   2009_10   34     White     High School    male
1   2009_10    4     Other            None    male
2   2009_10   16     Black            None    male
3   2009_10   10     Black            None    male
4   2009_10   60     Black     High School  female
5   2009_10   26   Mexican  9 - 11th Grade    male
6   2009_10   49     White    Some College  female
7   2009_10    1     White            None  female
8   2009_10   10  Hispanic            None    male
9   2009_10   80     White    Some College    male
10  2009_10   10   Mexican            None    male